blogs/discontinuous-galerkin-method-from-scratch-in-python-mapping-reference-to-physical.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-05 Wed 12:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DG Method From Scratch (in Python) - Mapping</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.7.2/css/all.min.css">
<link href="https://fonts.googleapis.com/css2?family=Roboto+Serif:ital,opsz,wght@0,8..144,100..900;1,8..144,100..900&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/css/styles.css" />
<base target="_blank">
</head>
<body>
<div id="preamble" class="status">
<nav>
    <!-- Checkbox for toggling menu -->
    <input type="checkbox" id="check">
    <!-- Menu icon -->
    <label for="check" class="checkbtn">
      <i class="fas fa-bars"></i>
    </label>
    <!-- Site logo -->
    <label class="logo"><a href="/index.html">Go Van Go</a></label>
    <!-- Navigation links -->
    <ul class="navbar-ul">
      <li><a target="_self" class="active" href="/index.html">Home</a></li>
      <li><a target="_self" href="/about.html">About</a></li>
      <li><a target="_self" href="/blog.html">Blog</a></li>
      <li><a target="_self" href="/contact.html">Contact</a></li>
    </ul>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">DG Method From Scratch (in Python) - Mapping
<br>
<span class="subtitle">From reference space to physical space</span>
</h1>
<p class="date"><i>last update: Feb 3, 2025</i></p>
<div id="outline-container-org2872f15" class="outline-2">
<h2 id="org2872f15">Article Motivation</h2>
<div class="outline-text-2" id="text-org2872f15">
<blockquote>
<ul class="org-ul">
<li>How do I map my nodes from the reference element to the mesh?<br></li>
<li>How do I find the Jacobians and surface Jacobians for each cell and cell face in my mesh?<br></li>
<li>How do I find the normal vectors for each face in each cell?<br></li>
<li>Code it in python<br></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-org7d6f968" class="outline-2">
<h2 id="org7d6f968">Introduction</h2>
<div class="outline-text-2" id="text-org7d6f968">
<p>
In the <a href="https://www.govango.org/blogs/discontinuous-galerkin-method-from-scratch-in-python-gmsh">last post on extracting information from a Gmsh mesh</a> we created numpy arrays that held the necessary connectivity data about our mesh, telling us things like which cells were adjacent and which faces were touching.<br>
</p>

<p>
Now we need to go one step further and map our nodal basis from the reference tetrahedron to each cell in our mesh. This means we need to create numpy arrays for the coordinates for each node in each cell in our mesh.<br>
</p>
</div>
</div>
<div id="outline-container-org50b1e2b" class="outline-2">
<h2 id="org50b1e2b">References</h2>
<div class="outline-text-2" id="text-org50b1e2b">
<style>.csl-left-margin{float: left; padding-right: 0em;}
 .csl-right-inline{margin: 0 0 0 0em;}</style><div class="csl-bib-body">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
   <p>Go Van Go!</p>
   <a href="https://github.com/go-van-go" target="_blank" rel="noopener noreferrer">
     <i class="fa-brands fa-github githubfooter"></i>
   </a>
</footer>
</div>
</body>
</html>
